const map = L.map("map", {worldCopyJump:true}).setView([0, 0], 2)
const get = id => document.getElementById(id)

const dataList = [
  [ 64.1333, -21.9333, ["アイスランド共和国", "アイスランド"], "レイキャヴィーク"],
  [ 53.3427,  -6.2661, ["アイルランド共和国", "アイルランド"], "ダブリン"],
  [ 40.3795,  49.8912, ["アゼルバイジャン共和国", "アゼルバイジャン"], "バクー"],
  [ 34.5330,  69.1661, ["アフガニスタン・イスラム共和国", "アフガニスタン"], "カーブル"],
  [ 38.8951, -77.0366, ["アメリカ合衆国", "アメリカ"], "ワシントンD.C."],
  [ 24.4666,  54.3666, ["アラブ首長国連邦", "アブダビ首長国"], "アブダビ"],
  [ 36.7763,   3.0586, ["アルジェリア民主人民共和国", "アルジェリア"], "アルジェ"],
  [-34.6036, -58.3816, ["アルゼンチン共和国",　"アルゼンチン"], "ブエノスアイレス"],
  [ 41.3300,  19.8200, ["アルバニア共和国", "アルバニア"], "ティラナ"],
  [ 40.1591,  44.5091, ["アルメニア共和国", "アルメニア"], "エレバン"],
  [ -8.9393,  13.2344, ["アンゴラ共和国", "アンゴラ"], "ルアンダ"],
  [ 17.1166, -61.8500, ["アンティグア・バーブーダ"], "セントジョンズ"],
  [ 42.5000,   1.5000, ["アンドラ公国", "アンドラ"], "アンドラ・ラ・ベリャ"],

  [ 15.3547,  44.2067, ["イエメン共和国", "イエメン"], "サナア"],
  [ 51.5077,  -0.1052, ["グレートブリテン及び北アイルランド連合王国", "イギリス"], "ロンドン"],
  [ 31.7833,  35.2166, ["イスラエル国", "イスラエル"], "エルサレム"],
  [ 41.8930,  12.4827, ["イタリア共和国", "イタリア"], "ローマ"],
  [ 33.3333,  44.4333, ["イラク共和国", "イラク"], "バグダード"],
  [ 35.6833,  51.4166, ["イラン・イスラム共和国", "イラン"], "テヘラン"],
  [ 28.6138,  77.2088, ["インド"], "ニューデリー"],
  [ -6.2000, 106.8000, ["インドネシア共和国", "インドネシア"], "ジャカルタ"],

  [  0.3166,  32.5833, ["ウガンダ共和国", "ウガンダ"], "カンパラ"],
  [ 50.4500,  30.5000, ["ウクライナ"], "キエフ"],
  [ 41.3000,  69.2666, ["ウズベキスタン共和国", "ウズベキスタン"], "タシュケント"],
  [-34.8833, -56.1666, ["ウルグアイ東方共和国", "ウルグアイ"], "モンテビデオ"],
  
  [ -0.2166, -78.5166, ["エクアドル共和国", "エクアドル"], "キト"],
  [ 30.0561,  31.2394, ["エジプト・アラブ共和国", "エジプト"], "カイロ"],
  [ 59.4372,  24.7452, ["エストニア共和国", "エストニア"], "タリン"],
  [-26.3166,  31.1333, ["エスワティニ王国", "エスワティニ"], "ムババーネ"],
  [  9.0300,  38.7400, ["エチオピア連邦民主共和国", "エチオピア"], "アディスアベバ"],
  [ 15.3333,  38.9166, ["エリトリア国", "エリトリア"], "アスマラ"],
  [ 13.6900, -89.1900, ["エルサルバドル共和国", "エルサルバドル"], "サンサルバドル"],

  [-19.0500, -65.2500, ["ボリビア他民族国", "ボリビア"], "スクレ"],
  [-15.8000, -47.8638, ["ブラジル連邦共和国", "ブラジル"], "ブラジリア"],
  [-33.4500, -70.6805, ["チリ共和国", "チリ"], "サンティアゴ"],
  [  4.6500, -74.0638, ["コロンビア共和国", "コロンビア"], "ボゴタ"],
  [  6.8000, -58.1666, ["ガイアナ共和国", "ガイアナ"], "ジョージタウン"],
  [-25.2963, -57.6413, ["パラグアイ共和国", "パラグアイ"], "アスンシオン"],
  [-12.0933, -77.0466, ["ペルー共和国", "ペルー"], "リマ"],
  [  5.8666, -55.1666, ["スリナム共和国", "スリナム"], "パラマリボ"],
  [ 10.5207, -66.9245, ["ベネズエラ・ボリバル共和国", "ベネズエラ"], "カラカス"]
]

var score = 0
var dataNum = dataList.length

function quiz(quizType) {
  get("overlay").style.display = "none"
  get("score").innerHTML = dataNum + " / " + dataNum

  L.tileLayer(
    "https://cyberjapandata.gsi.go.jp/xyz/std/{z}/{x}/{y}.png",
    {
      attribution: "Map data &copy; <a href='https://maps.gsi.go.jp/development/ichiran.html' target='_blank'>国土地理院</a>",
      minZoom: 2,
      maxZoom: quizType=="CapitalName"?3:4,
      zoomControl: false
    }
  ).addTo(map)

  for (let data of dataList) {
    let y = data[0]
    let x = data[1]
    let name = data[2]
    let capital = data[3]
    if (quizType == "CountryName") {
      L.marker([y,x]).on("click", function(e) {
        let ans = prompt('首都を"' + capital + '"に置くこの国の名前は？')
        if (name.includes(ans)) {
          alert("正解！")
          map.removeLayer(e.target)
          score++
          get("score").innerHTML = (dataNum-score) + " / " + dataNum
        } else {
          alert('不正解！\n答えは"' + name[0] + '"です')
        }
      }).addTo(map)
    } else if (quizType == "CapitalName") {
      L.marker([y,x]).on("click", function(e) {
        let ans = prompt('"' + name[0] + '"の首都の名前は？')
        if (ans == capital) {
          alert("正解！")
          map.removeLayer(e.target)
          score++
          get("score").innerHTML = (dataNum-score) + " / " + dataNum
        } else {
          alert('不正解！\n答えは"' + capital + '"です')
        }
      }).addTo(map)
    }
  }
}